; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-2-19)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-5 - location
	p0-6 - location
	p1-0 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p3-0 - location
	p4-1 - location
	p4-6 - location
	p5-3 - location
	p6-2 - location
	p6-5 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s2)
	(at driver3 s5)
	(at driver4 s0)
	(at driver5 s2)
	(at driver6 s2)
	(at driver7 s3)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at package1 s0)
	(at package2 s0)
	(at package3 s2)
	(at package4 s3)
	(at package5 s5)
	(at package6 s6)
	(at package7 s2)
	(at package8 s2)
	(at package9 s2)
	(at package10 s5)
	(at package11 s2)
	(at package12 s5)
	(at package13 s2)
	(at package14 s6)
	(at package15 s6)
	(at package16 s2)
	(at package17 s1)
	(at package18 s1)
	(at package19 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s6)
	(link s6 s0)
	(link s1 s0)
	(link s0 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s2 s6)
	(link s6 s2)
	(link s4 s0)
	(link s0 s4)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s4)
	(link s4 s5)
	(link s5 s6)
	(link s6 s5)
)
	(:goal (and
	(at driver5 s3)
	(at driver6 s6)
	(at truck1 s4)
	(at truck2 s0)
	(at package1 s0)
	(at package2 s5)
	(at package3 s1)
	(at package4 s6)
	(at package5 s6)
	(at package6 s1)
	(at package7 s4)
	(at package8 s1)
	(at package9 s3)
	(at package10 s6)
	(at package11 s0)
	(at package12 s0)
	(at package13 s3)
	(at package14 s6)
	(at package15 s5)
	(at package16 s5)
	(at package17 s0)
	(at package18 s2)
	(at package19 s5)
	))


)

; plan
1. (walk driver4 s0 p1-0)
   deleted: (at driver4 s0)
   added: (at driver4 p1-0)
   goals met: 2 of 23
2. (walk driver4 p1-0 s1)
   deleted: (at driver4 p1-0)
   added: (at driver4 s1)
   goals met: 2 of 23
3. (board-truck driver4 s1 truck1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 23
4. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 2 of 23
5. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 2 of 23
6. (board-truck driver7 s3 truck2)
   deleted: (at driver7 s3) (empty truck2)
   added: (driving driver7 truck2)
   goals met: 2 of 23
7. (drive-truck driver7 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 3 of 23
8. (walk driver5 s2 p2-3)
   deleted: (at driver5 s2)
   added: (at driver5 p2-3)
   goals met: 3 of 23
9. (walk driver5 p2-3 s3)
   deleted: (at driver5 p2-3)
   added: (at driver5 s3)
   goals met: 4 of 23
10. (walk driver6 s2 p6-2)
   deleted: (at driver6 s2)
   added: (at driver6 p6-2)
   goals met: 4 of 23
11. (walk driver6 p6-2 s6)
   deleted: (at driver6 p6-2)
   added: (at driver6 s6)
   goals met: 5 of 23
12. (load-truck s2 package9 truck1)
   deleted: (at package9 s2)
   added: (in package9 truck1)
   goals met: 5 of 23
13. (load-truck s2 package8 truck1)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 5 of 23
14. (load-truck s2 package7 truck1)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 5 of 23
15. (load-truck s2 package3 truck1)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 5 of 23
16. (load-truck s2 package19 truck1)
   deleted: (at package19 s2)
   added: (in package19 truck1)
   goals met: 5 of 23
17. (drive-truck driver4 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 6 of 23
18. (unload-truck s4 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s4)
   goals met: 7 of 23
19. (drive-truck driver4 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 6 of 23
20. (drive-truck driver7 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 5 of 23
21. (unload-truck s1 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s1)
   goals met: 6 of 23
22. (unload-truck s1 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 7 of 23
23. (drive-truck driver4 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 7 of 23
24. (load-truck s0 package2 truck1)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 7 of 23
25. (drive-truck driver4 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 8 of 23
26. (drive-truck driver4 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 7 of 23
27. (load-truck s5 package5 truck1)
   deleted: (at package5 s5)
   added: (in package5 truck1)
   goals met: 7 of 23
28. (unload-truck s5 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s5)
   goals met: 8 of 23
29. (drive-truck driver4 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 9 of 23
30. (load-truck s2 package16 truck2)
   deleted: (at package16 s2)
   added: (in package16 truck2)
   goals met: 9 of 23
31. (drive-truck driver7 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 9 of 23
32. (unload-truck s5 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s5)
   goals met: 10 of 23
33. (load-truck s5 package12 truck2)
   deleted: (at package12 s5)
   added: (in package12 truck2)
   goals met: 10 of 23
34. (drive-truck driver7 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 11 of 23
35. (drive-truck driver4 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 10 of 23
36. (load-truck s2 package13 truck1)
   deleted: (at package13 s2)
   added: (in package13 truck1)
   goals met: 10 of 23
37. (load-truck s2 package11 truck1)
   deleted: (at package11 s2)
   added: (in package11 truck1)
   goals met: 10 of 23
38. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 10 of 23
39. (unload-truck s0 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s0)
   goals met: 11 of 23
40. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 11 of 23
41. (unload-truck s3 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s3)
   goals met: 12 of 23
42. (drive-truck driver4 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 13 of 23
43. (drive-truck driver4 s4 s6 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   goals met: 12 of 23
44. (load-truck s6 package6 truck1)
   deleted: (at package6 s6)
   added: (in package6 truck1)
   goals met: 12 of 23
45. (drive-truck driver4 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 13 of 23
46. (unload-truck s0 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s0)
   goals met: 14 of 23
47. (drive-truck driver7 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 13 of 23
48. (load-truck s1 package18 truck2)
   deleted: (at package18 s1)
   added: (in package18 truck2)
   goals met: 13 of 23
49. (drive-truck driver7 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 14 of 23
50. (drive-truck driver7 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 13 of 23
51. (unload-truck s2 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s2)
   goals met: 14 of 23
52. (drive-truck driver7 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 15 of 23
53. (drive-truck driver7 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 14 of 23
54. (load-truck s3 package4 truck2)
   deleted: (at package4 s3)
   added: (in package4 truck2)
   goals met: 14 of 23
55. (drive-truck driver7 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 15 of 23
56. (drive-truck driver7 s0 s6 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   goals met: 14 of 23
57. (unload-truck s6 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s6)
   goals met: 15 of 23
58. (load-truck s6 package15 truck2)
   deleted: (at package15 s6)
   added: (in package15 truck2)
   goals met: 15 of 23
59. (drive-truck driver7 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 16 of 23
60. (drive-truck driver7 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 15 of 23
61. (unload-truck s5 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s5)
   goals met: 16 of 23
62. (load-truck s5 package10 truck2)
   deleted: (at package10 s5)
   added: (in package10 truck2)
   goals met: 16 of 23
63. (drive-truck driver7 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 17 of 23
64. (drive-truck driver7 s0 s6 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   goals met: 16 of 23
65. (unload-truck s6 package10 truck2)
   deleted: (in package10 truck2)
   added: (at package10 s6)
   goals met: 17 of 23
66. (drive-truck driver7 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 18 of 23
67. (drive-truck driver7 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 17 of 23
68. (load-truck s1 package17 truck2)
   deleted: (at package17 s1)
   added: (in package17 truck2)
   goals met: 17 of 23
69. (drive-truck driver7 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 18 of 23
70. (unload-truck s0 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s0)
   goals met: 19 of 23
71. (drive-truck driver4 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 18 of 23
72. (unload-truck s5 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s5)
   goals met: 19 of 23
73. (drive-truck driver4 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 20 of 23
74. (drive-truck driver4 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 19 of 23
75. (unload-truck s1 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s1)
   goals met: 20 of 23
76. (drive-truck driver4 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 21 of 23
77. (drive-truck driver4 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 20 of 23
78. (unload-truck s3 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s3)
   goals met: 21 of 23
79. (drive-truck driver4 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 22 of 23
80. (drive-truck driver4 s4 s6 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   goals met: 21 of 23
81. (unload-truck s6 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s6)
   goals met: 22 of 23
82. (drive-truck driver4 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 23 of 23
